src/cf/Catalogs/КалендарьПодготовкиОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КалендарьПодготовкиОтчетности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиКалендаряПодготовкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИнформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОбработкиСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВКалендаре</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяДляИП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяДляООО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеренесенногоОкончанияСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСобытияДляПострадавших</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпрощенныйЗачетФиксированныхВзносов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыСобытийКалендаряОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыСобытийКалендаряОтчетности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендарьПодготовкиОтчетности</v8:Type>
						<v8:Type>cfg:CatalogRef.КалендарьПерсональныхЗадачОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыУНФ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПротоколыПроверкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПротоколыПроверкиДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Comment>Дерево значений протокола</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьПредупреждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендарьПодготовкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/КалендарьПодготовкиОтчетности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьКалендарьПодготовкиОтчетности(АдресФайла = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;

	Если АдресФайла = Неопределено Тогда
		Макет = Справочники.КалендарьПодготовкиОтчетности.ПолучитьМакет("Макет");
		ТабЗн = ОбщегоНазначения.ПрочитатьXMLВТаблицу(Макет.ПолучитьТекст()).Данные;
	Иначе
		Попытка
			Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
				ИмяФайла = КаталогВременныхФайлов()+"ЗадачиКалендаря.txt";
				ДвоичныеДанные.Записать(ИмяФайла);
				Данные = Новый ТекстовыйДокумент;
				Данные.Прочитать(ИмяФайла, КодировкаТекста.ANSI);
				УдалитьИзВременногоХранилища(АдресФайла);
				УдалитьФайлы(ИмяФайла);
				ТабЗн = ОбщегоНазначения.ПрочитатьXMLВТаблицу(Данные.ПолучитьТекст()).Данные;
			Иначе
				Данные = Новый ТекстовыйДокумент;
				Данные.Прочитать(АдресФайла);
				ТабЗн = ОбщегоНазначения.ПрочитатьXMLВТаблицу(Данные.ПолучитьТекст()).Данные;
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	РезультирующаяТаблица = Новый ТаблицаЗначений;
	РезультирующаяТаблица.Колонки.Добавить("Задача", Новый ОписаниеТипов("СправочникСсылка.ЗадачиКалендаряПодготовкиОтчетности"));
	РезультирующаяТаблица.Колонки.Добавить("ДатаНачалаИнформирования", Новый ОписаниеТипов("Дата"));
	РезультирующаяТаблица.Колонки.Добавить("ДатаНачалаСобытия", Новый ОписаниеТипов("Дата"));
	РезультирующаяТаблица.Колонки.Добавить("ДатаОкончанияСобытия", Новый ОписаниеТипов("Дата"));
	РезультирующаяТаблица.Колонки.Добавить("ДатаДокументаОбработкиСобытия", Новый ОписаниеТипов("Дата"));
	РезультирующаяТаблица.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	РезультирующаяТаблица.Колонки.Добавить("ПредставлениеВКалендаре", Новый ОписаниеТипов("Строка"));
	РезультирующаяТаблица.Колонки.Добавить("ДатаНачалаДокументов", Новый ОписаниеТипов("Дата"));
	РезультирующаяТаблица.Колонки.Добавить("ДатаОкончанияДокументов", Новый ОписаниеТипов("Дата"));
	РезультирующаяТаблица.Колонки.Добавить("ПрименяетсяДляИП", Новый ОписаниеТипов("Булево"));
	РезультирующаяТаблица.Колонки.Добавить("ПрименяетсяДляООО", Новый ОписаниеТипов("Булево"));
	РезультирующаяТаблица.Колонки.Добавить("ДатаПеренесенногоОкончанияСобытия", Новый ОписаниеТипов("Дата"));
	РезультирующаяТаблица.Колонки.Добавить("ДатаОкончанияСобытияДляПострадавших", Новый ОписаниеТипов("Дата"));
	РезультирующаяТаблица.Колонки.Добавить("УпрощенныйЗачетФиксированныхВзносов", Новый ОписаниеТипов("Булево"));

	Для Каждого Задача Из ТабЗн Цикл
		
		НоваяСтрокаРезультата = РезультирующаяТаблица.Добавить();
		НоваяСтрокаРезультата.Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности[Задача.Задача];
		НоваяСтрокаРезультата.ДатаНачалаИнформирования = Дата(Задача.ДатаНачалаИнформирования);
		НоваяСтрокаРезультата.ДатаНачалаСобытия = Дата(Задача.ДатаНачалаСобытия);
		НоваяСтрокаРезультата.ДатаОкончанияСобытия = Дата(Задача.ДатаОкончанияСобытия);
		НоваяСтрокаРезультата.ДатаДокументаОбработкиСобытия = Дата(Задача.ДатаДокументаОбработкиСобытия);
		НоваяСтрокаРезультата.Комментарий = Задача.Комментарий;
		НоваяСтрокаРезультата.ПредставлениеВКалендаре = Задача.ПредставлениеВКалендаре;
		НоваяСтрокаРезультата.ДатаНачалаДокументов = Дата(Задача.ДатаНачалаДокументов);
		НоваяСтрокаРезультата.ДатаОкончанияДокументов = Дата(Задача.ДатаОкончанияДокументов);
		НоваяСтрокаРезультата.ПрименяетсяДляИП = (Задача.ПрименяетсяДляИП = "Истина");
		НоваяСтрокаРезультата.ПрименяетсяДляООО = (Задача.ПрименяетсяДляООО = "Истина");
		Если Не ПустаяСтрока(Задача.ДатаПеренесенногоОкончанияСобытия) Тогда
			НоваяСтрокаРезультата.ДатаПеренесенногоОкончанияСобытия = Дата(Задача.ДатаПеренесенногоОкончанияСобытия);
		КонецЕсли;
		Если Не ПустаяСтрока(Задача.ДатаОкончанияСобытияДляПострадавших) Тогда
			НоваяСтрокаРезультата.ДатаОкончанияСобытияДляПострадавших = Дата(Задача.ДатаОкончанияСобытияДляПострадавших);
		КонецЕсли; 
		НоваяСтрокаРезультата.УпрощенныйЗачетФиксированныхВзносов = (Задача.УпрощенныйЗачетФиксированныхВзносов = "Истина");
	КонецЦикла;
	// Обрабатываем таблицу
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВрТаблица.Задача КАК Задача,
	|	ВрТаблица.ДатаНачалаИнформирования КАК ДатаНачалаИнформирования,
	|	ВрТаблица.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	ВрТаблица.ДатаОкончанияСобытия КАК ДатаОкончанияСобытия,
	|	ВрТаблица.ДатаДокументаОбработкиСобытия КАК ДатаДокументаОбработкиСобытия,
	|	ВрТаблица.Комментарий КАК Комментарий,
	|	ВрТаблица.ПредставлениеВКалендаре КАК ПредставлениеВКалендаре,
	|	ВрТаблица.ДатаНачалаДокументов КАК ДатаНачалаДокументов,
	|	ВрТаблица.ДатаОкончанияДокументов КАК ДатаОкончанияДокументов,
	|	ВрТаблица.ДатаПеренесенногоОкончанияСобытия КАК ДатаПеренесенногоОкончанияСобытия,
	|	ВрТаблица.ДатаОкончанияСобытияДляПострадавших КАК ДатаОкончанияСобытияДляПострадавших,
	|	ВрТаблица.ПрименяетсяДляИП КАК ПрименяетсяДляИП,
	|	ВрТаблица.ПрименяетсяДляООО КАК ПрименяетсяДляООО,
	|	ВрТаблица.УпрощенныйЗачетФиксированныхВзносов КАК УпрощенныйЗачетФиксированныхВзносов
	|ПОМЕСТИТЬ ВрТаблица
	|ИЗ
	|	&Таблица КАК ВрТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаблица.ДатаНачалаИнформирования КАК ДатаНачалаИнформирования,
	|	ВрТаблица.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	ВрТаблица.ДатаОкончанияСобытия КАК ДатаОкончанияСобытия,
	|	ВрТаблица.ДатаДокументаОбработкиСобытия КАК ДатаДокументаОбработкиСобытия,
	|	ВрТаблица.Комментарий КАК Комментарий,
	|	ВрТаблица.ПредставлениеВКалендаре КАК ПредставлениеВКалендаре,
	|	ВрТаблица.ДатаНачалаДокументов КАК ДатаНачалаДокументов,
	|	ВрТаблица.ДатаОкончанияДокументов КАК ДатаОкончанияДокументов,
	|	ВрТаблица.ДатаПеренесенногоОкончанияСобытия КАК ДатаПеренесенногоОкончанияСобытия,
	|	ВрТаблица.ДатаОкончанияСобытияДляПострадавших КАК ДатаОкончанияСобытияДляПострадавших,
	|	ВрТаблица.ПрименяетсяДляИП КАК ПрименяетсяДляИП,
	|	ВрТаблица.ПрименяетсяДляООО КАК ПрименяетсяДляООО,
	|	ВрТаблица.УпрощенныйЗачетФиксированныхВзносов КАК УпрощенныйЗачетФиксированныхВзносов,
	|	ВрТаблица.Задача КАК Задача,
	|	Календарь.Ссылка КАК Событие
	|ИЗ
	|	ВрТаблица КАК ВрТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КалендарьПодготовкиОтчетности КАК Календарь
	|		ПО (Календарь.ДатаОкончанияСобытия = ВрТаблица.ДатаОкончанияСобытия)
	|			И (Календарь.Задача = ВрТаблица.Задача)
	|			И (НЕ Календарь.ПометкаУдаления)
	|			И (ГОД(ВрТаблица.ДатаДокументаОбработкиСобытия) = ГОД(Календарь.ДатаДокументаОбработкиСобытия))";
	Запрос.УстановитьПараметр("Таблица", РезультирующаяТаблица);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Событие) Тогда
			Событие = Выборка.Событие.ПолучитьОбъект();
		Иначе
			// Создаем события в календаре
			Событие = Справочники.КалендарьПодготовкиОтчетности.СоздатьЭлемент();
			Событие.Задача = Выборка.Задача;
		КонецЕсли;
		Событие.ДатаНачалаИнформирования = Выборка.ДатаНачалаИнформирования;
		Событие.ДатаНачалаСобытия = Выборка.ДатаНачалаСобытия;
		Событие.ДатаОкончанияСобытия = Выборка.ДатаОкончанияСобытия;
		Событие.ДатаДокументаОбработкиСобытия = Выборка.ДатаДокументаОбработкиСобытия;
		Событие.Комментарий = Выборка.Комментарий;
		Событие.ПредставлениеВКалендаре = Выборка.ПредставлениеВКалендаре;
		Событие.ДатаНачалаДокументов = Выборка.ДатаНачалаДокументов;
		Событие.ДатаОкончанияДокументов = Выборка.ДатаОкончанияДокументов;
		Событие.ПрименяетсяДляИП = Выборка.ПрименяетсяДляИП;
		Событие.ПрименяетсяДляООО = Выборка.ПрименяетсяДляООО;
		Событие.ДатаПеренесенногоОкончанияСобытия = Выборка.ДатаПеренесенногоОкончанияСобытия;
		Событие.ДатаОкончанияСобытияДляПострадавших = Выборка.ДатаОкончанияСобытияДляПострадавших;        
		Событие.УпрощенныйЗачетФиксированныхВзносов = Выборка.УпрощенныйЗачетФиксированныхВзносов;
		Событие.Записать();
	КонецЦикла;
	
	ПроверитьДубли_2023();
	
КонецПроцедуры

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("Наименование");
	Результат.Добавить("ПометкаУдаления");
	
	Возврат Результат;
	
КонецФункции


// Обновляет записи страховых взносов при доходах свыше 300 т.р.
// 
Процедура ОбновитьЗаписиСтраховыеВзносыПриДоходахСвыше300тр() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КалендарьПодготовкиОтчетности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|ГДЕ
	|	КалендарьПодготовкиОтчетности.Задача = ЗНАЧЕНИЕ(Справочник.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300ТР)
	|	И КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия = &Год2024");
	Запрос.УстановитьПараметр("Год2024", Дата(2024, 04, 01));

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗадачаКалендаря = Выборка.Ссылка.ПолучитьОбъект();
		ЗадачаКалендаря.ДатаОкончанияСобытия = Дата(2024, 07, 01);  
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЗадачаКалендаря, Ложь, Ложь);
	КонецЦикла;

КонецПроцедуры 

Процедура ОбновитьСрокВЗадачеКалендаря(ВидЗадачиКалендаря, ДатаОкончанияСобытия, НоваяДатаОкончанияСобытия) Экспорт

	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КалендарьПодготовкиОтчетности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|ГДЕ
	|	КалендарьПодготовкиОтчетности.Задача = &ЗадачаКалендаря
	|	И КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия = &ДатаОкончанияСобытия");
	Запрос.УстановитьПараметр("ЗадачаКалендаря", ВидЗадачиКалендаря); 
	Запрос.УстановитьПараметр("ДатаОкончанияСобытия", ДатаОкончанияСобытия);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗадачаКалендаря = Выборка.Ссылка.ПолучитьОбъект();
		ЗадачаКалендаря.ДатаОкончанияСобытия = НоваяДатаОкончанияСобытия;  
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЗадачаКалендаря, Ложь, Ложь);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДубли() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалендарьПодготовкиОтчетности.Задача КАК Задача,
	|	КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия КАК ДатаОкончанияСобытия
	|ПОМЕСТИТЬ ВТДубли
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|ГДЕ
	|	НЕ КалендарьПодготовкиОтчетности.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	КалендарьПодготовкиОтчетности.Задача,
	|	КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(КалендарьПодготовкиОтчетности.Задача) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалендарьПодготовкиОтчетности.Ссылка КАК Ссылка,
	|	КалендарьПодготовкиОтчетности.Задача КАК ТипЗадачи,
	|	КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия КАК ДатаОкончанияСобытия
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДубли КАК ВТДубли
	|		ПО (ВТДубли.Задача = КалендарьПодготовкиОтчетности.Задача)
	|			И (ВТДубли.ДатаОкончанияСобытия = КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КалендарьПодготовкиОтчетности.Задача,
	|	КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия";
	
	ВыборкаПоЗадачам = Запрос.Выполнить().Выбрать();
	ТипЗадачи = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ПустаяСсылка();
	ДатаОкончания = Дата('00010101');
	Пока ВыборкаПоЗадачам.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаПоЗадачам.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		Если ДатаОкончания <> ВыборкаПоЗадачам.ДатаОкончанияСобытия 
			ИЛИ ТипЗадачи <>  ВыборкаПоЗадачам.ТипЗадачи Тогда
			ДатаОкончания = ВыборкаПоЗадачам.ДатаОкончанияСобытия;
			ТипЗадачи =  ВыборкаПоЗадачам.ТипЗадачи;
			Продолжить;
		КонецЕсли;
		
		Задача = ВыборкаПоЗадачам.Ссылка.ПолучитьОбъект();
		Задача.УстановитьПометкуУдаления(Истина);
		Сообщить(Задача);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьДубли_2023() Экспорт
		
		Запрос = Новый Запрос; 
		ТекстЗапроса = 	"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(КалендарьПодготовкиОтчетности.Наименование) КАК КоличествоДублей,
		|	КалендарьПодготовкиОтчетности.Наименование КАК Наименование
		|ИЗ
		|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
		|СГРУППИРОВАТЬ ПО
		|	КалендарьПодготовкиОтчетности.Наименование
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(КалендарьПодготовкиОтчетности.Наименование) > 1";	
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НачатьТранзакцию();
			
			Попытка 
				
				СобытиеКУдалению = НайтиСобытиеКУдалениюПоНаименованию(ВыборкаДетальныеЗаписи.Наименование);
				Если СобытиеКУдалению <> Неопределено Тогда 
					СобытиеКУдалению = СобытиеКУдалению.Ссылка.ПолучитьОбъект();   
					НаименованиеДляПоиска = СобытиеКУдалению.Наименование; 
					СобытиеКУдалению.Наименование = "Удалить" + Строка(СобытиеКУдалению.Ссылка.УникальныйИдентификатор()) + СобытиеКУдалению.Наименование; 
					СобытиеКУдалению.Код = ""; 
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(СобытиеКУдалению);
					СобытиеКУдалению.УстановитьПометкуУдаления(Истина);  
					
					СписокСсылок = Новый Массив;
					СписокСсылок.Добавить(СобытиеКУдалению.Ссылка);
					СсылкиНаОбъекты = НайтиПоСсылкам(СписокСсылок); 
					Эталон = НайтиЭталонПоНаименованию(НаименованиеДляПоиска); 
					
					Если Эталон <> Неопределено Тогда   
						ЭталонОбъект = Эталон.ПолучитьОбъект();
						ЭталонОбъект.УстановитьПометкуУдаления(Ложь); 
						
						
						// 1. заменяем ссылки в базе
						Если СсылкиНаОбъекты.Количество()>0 Тогда
							Для Каждого ОбъектДанных Из СсылкиНаОбъекты Цикл
								
								СсылкаВБазе = ОбъектДанных.Данные;
								
								Если Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности") = ТипЗнч(СсылкаВБазе) Тогда
									СсылкаВБазе = СсылкаВБазе.ПолучитьОбъект();
									СсылкаВБазе.СобытиеКалендаря = Эталон;
									СсылкаВБазе.Записать();
								ИначеЕсли Тип("РегистрСведенийКлючЗаписи.ДокументыСобытийКалендаряОтчетности") = ТипЗнч(СсылкаВБазе) Тогда
									Запись = РегистрыСведений.ДокументыСобытийКалендаряОтчетности.СоздатьМенеджерЗаписи();
									ЗаполнитьЗначенияСвойств(Запись, СсылкаВБазе);
									Запись.Прочитать();
									Запись.Событие = Эталон;
									Запись.Записать();
								ИначеЕсли Тип("РегистрСведенийКлючЗаписи.ПротоколыПроверкиДанных") = ТипЗнч(СсылкаВБазе) Тогда
									Запись = РегистрыСведений.ПротоколыПроверкиДанных.СоздатьМенеджерЗаписи();
									ЗаполнитьЗначенияСвойств(Запись, СсылкаВБазе);
									Запись.Прочитать();
									Запись.СобытиеКалендаря = Эталон;
									Запись.Записать();
								КонецЕсли;
								
							КонецЦикла; 
						КонецЕсли; 
						
						ЗафиксироватьТранзакцию();  
						
					Иначе 	 
						//ложное срабатывание
						ОтменитьТранзакцию();	
					КонецЕсли;	
				КонецЕсли; 			
				
			Исключение
				ОтменитьТранзакцию(); 
				
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка выполнения обработки дублей в справочнике ""Календарь налогов и отчетности""'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
				
			КонецПопытки;
		КонецЦикла;  		
		
		Запрос = Неопределено;
		РезультатЗапроса = Неопределено;  
		
		Запрос = Новый Запрос; 	
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапросаПроверка = Запрос.Выполнить();
		
		Если НЕ РезультатЗапросаПроверка.Пустой() Тогда
			ПроверитьДубли_2023();	
		КонецЕсли; 
		
КонецПроцедуры    

	
Функция НайтиЭталонПоНаименованию(Наименование)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КалендарьПодготовкиОтчетности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|ГДЕ
	|	КалендарьПодготовкиОтчетности.Наименование = &Наименование
	|	И НЕ КалендарьПодготовкиОтчетности.Наименование ПОДОБНО ""Удалить%""";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

Функция НайтиСобытиеКУдалениюПоНаименованию(Наименование)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КалендарьПодготовкиОтчетности.Ссылка КАК Ссылка,
	|	КалендарьПодготовкиОтчетности.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|ГДЕ
	|	КалендарьПодготовкиОтчетности.Наименование = &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	КалендарьПодготовкиОтчетности.ПометкаУдаления УБЫВ";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 
	
	
#КонецОбласти

#КонецЕсли
